cf/AccumulationRegisters/InventoryInWarehouses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>InventoryInWarehouses</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Catalogs/Products.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Products</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DetailedDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Comment>Property</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Comment>Value</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/AccumulationRegisters/InventoryInWarehouses/Ext/ManagerModule.bsl
#If Server Or ExternalConnection Then

#Region Public

// Controls the occurrence of negative balances.
//
// Parameters:
//  Ref - DocumentRef - ref to the posting document;
//  AdditionalProperties - Structure - additional properties;
//  Cancel - boolean - if this parameter is set to True, the document will not be posted.
//
Procedure NegativeBalanceControl(Ref, AdditionalProperties, Cancel) Export
	
	If AdditionalProperties.ForPosting.Property("IsInventoryInWarehousesChange")
		And AdditionalProperties.ForPosting.IsInventoryInWarehousesChange Then
		
		Query = New Query;
		Query.TempTablesManager = AdditionalProperties.ForPosting.TempTablesManager;
		Query.Text =
		"SELECT
		|	InventoryInWarehousesChange.Warehouse AS Warehouse,
		|	InventoryInWarehousesChange.Product AS Product,
		|	Products.Unit AS Unit,
		|	-InventoryInWarehousesBalance.QuantityBalance AS Shortage
		|FROM
		|	InventoryInWarehousesChange AS InventoryInWarehousesChange
		|		INNER JOIN Catalog.Products AS Products
		|		ON InventoryInWarehousesChange.Product = Products.Ref
		|		INNER JOIN AccumulationRegister.InventoryInWarehouses.Balance(, ) AS InventoryInWarehousesBalance
		|		ON InventoryInWarehousesChange.Warehouse = InventoryInWarehousesBalance.Warehouse
		|			AND InventoryInWarehousesChange.Product = InventoryInWarehousesBalance.Product
		|			AND (InventoryInWarehousesBalance.QuantityBalance < 0)
		|TOTALS BY
		|	Warehouse";
		
		Result = Query.Execute();
		If Not Result.IsEmpty() Then
			
			WarehouseSelection = Result.Select(QueryResultIteration.ByGroups);
			While WarehouseSelection.Next() Do
				
				MessageText = StringFunctionsClientServer.SubstituteParametersToString(NStr("en = 'Insufficient quantity on %1'; tr = '%1 miktarı yetersiz'"),
					WarehouseSelection.Warehouse);
				Common.MessageToUser(MessageText, Ref, , , Cancel);
				
				Selection = WarehouseSelection.Select();
				While Selection.Next() Do
					MessageText = StringFunctionsClientServer.SubstituteParametersToString(NStr("en = 'Product: %1, shortage %2 %3'; tr = 'Ürün: %1, eksiklik %2 %3'"),
						Selection.Product,
						Selection.Shortage,
						Selection.Unit);
					Common.MessageToUser(MessageText, Ref, , , Cancel);
				EndDo;
				
			EndDo;
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
